Revit 2027 API
StructuralConnectionHandler.ApprovalTypeId Property
 Retrieves or changes approval type of the Structural Connection Handler.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ApprovalTypeId { get; set; }
Public Property ApprovalTypeId As ElementId
	Get
	Set
public:
property ElementId^ ApprovalTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ApprovalTypeId : ElementId with get, set
Property Value
ElementId
 Name of connection.
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace